In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('./movies.csv')
df.head()

   Rank                         Title       Studio       Gross  Year
0     1             Avengers: Endgame  Buena Vista  $2,796.30   2019
1     2                        Avatar          Fox  $2,789.70   2009
2     3                       Titanic    Paramount  $2,187.50   1997
3     4  Star Wars: The Force Awakens  Buena Vista  $2,068.20   2015
4     5        Avengers: Infinity War  Buena Vista  $2,048.40   2018

In [ ]:
df.shape #Quais os números de linhas e colunas o DataFrame possui

(782, 5)

In [ ]:
df = pd.read_csv('./movies.csv', index_col = 'Title') #Transformou a coluna Title para ser o índice do DataFrame
df

                              Rank           Studio       Gross  Year
Title
Avengers: Endgame                1      Buena Vista  $2,796.30   2019
Avatar                           2              Fox  $2,789.70   2009
Titanic                          3        Paramount  $2,187.50   1997
Star Wars: The Force Awakens     4      Buena Vista  $2,068.20   2015
Avengers: Infinity War           5      Buena Vista  $2,048.40   2018
...                            ...              ...         ...   ...
Yogi Bear                      778  Warner Brothers    $201.60   2010
Garfield: The Movie            779              Fox    $200.80   2004
Cats & Dogs                    780  Warner Brothers    $200.70   2001
The Hunt for Red October       781        Paramount    $200.50   1990
Valkyrie                       782              MGM    $200.30   2008

[782 rows x 4 columns]

In [ ]:
df.head(4) #As 4 primeiras linhas do DataFrame

                              Rank       Studio       Gross  Year
Title
Avengers: Endgame                1  Buena Vista  $2,796.30   2019
Avatar                           2          Fox  $2,789.70   2009
Titanic                          3    Paramount  $2,187.50   1997
Star Wars: The Force Awakens     4  Buena Vista  $2,068.20   2015

In [ ]:
df.tail(6) #As 6 últimas linhas do DataFrame

                          Rank           Studio     Gross  Year
Title
21 Jump Street             777             Sony  $201.60   2012
Yogi Bear                  778  Warner Brothers  $201.60   2010
Garfield: The Movie        779              Fox  $200.80   2004
Cats & Dogs                780  Warner Brothers  $200.70   2001
The Hunt for Red October   781        Paramount  $200.50   1990
Valkyrie                   782              MGM  $200.30   2008

In [ ]:
len(df) #Quantas linhas o DataFrame possui

782

In [ ]:
df.size #Total de números de células que o DataFrame possui

3128

In [ ]:
df.dtypes #Quais os tipos de dados cada coluna possui (int64 -> inteiros; object -> strings)

Rank       int64
Studio    object
Gross     object
Year       int64
dtype: object

In [ ]:
df.iloc[499] #Utilizando o índice da linha para ver os dados das colunas

Rank           500
Studio         Fox
Gross     $288.30
Year          2018
Name: Maze Runner: The Death Cure, dtype: object

In [ ]:
df.loc['Forrest Gump'] #Utilizando o nome da linha para ver os dados das colunas

Rank            119
Studio    Paramount
Gross      $677.90
Year           1994
Name: Forrest Gump, dtype: object

In [ ]:
df.loc['101 Dalmatians'] #Neste DataFrame existe dados duplicados

                Rank       Studio     Gross  Year
Title
101 Dalmatians   425  Buena Vista  $320.70   1996
101 Dalmatians   708  Buena Vista  $215.90   1961

In [ ]:
df.sort_values(by = 'Year', ascending = False).head() #Ordenar (sort_values) os 5 filmes mais recentes por ano (by = 'Year) do mais recente para o mais antigo (ascending = False, True seria o contrário)

,Rank,Studio,Gross,Year
Title,,,,
Avengers: Endgame,1,Buena Vista,"$2,796.30",2019
John Wick: Chapter 3 - Parabellum,458,Lionsgate,$304.70,2019
The Wandering Earth,114,China Film Corporation,$699.80,2019
Toy Story 4,198,Buena Vista,$519.80,2019
How to Train Your Dragon: The Hidden World,199,Universal,$519.80,2019

In [ ]:
df.sort_values(by = ['Studio', 'Year']).head() #Ordenar de forma alfabética utilizando primeiro a coluna do Studio e depois pela coluna do Year

                         Rank       Studio     Gross  Year
Title
The Blair Witch Project   588      Artisan  $248.60   1999
101 Dalmatians            708  Buena Vista  $215.90   1961
The Jungle Book           755  Buena Vista  $205.80   1967
Who Framed Roger Rabbit   410  Buena Vista  $329.80   1988
Dead Poets Society        636  Buena Vista  $235.90   1989

In [ ]:
df.sort_index().head() #Ordenar de forma alfabética pelo índice do DataFrame (por padrão o ascending é True, se quiser pode df.sort_index(ascending = False).head() que irá começar ao contrário na ordem alfabética)

                  Rank           Studio     Gross  Year
Title
10,000 B.C.        536  Warner Brothers  $269.80   2008
101 Dalmatians     708      Buena Vista  $215.90   1961
101 Dalmatians     425      Buena Vista  $320.70   1996
2 Fast 2 Furious   632        Universal  $236.40   2003
2012                93             Sony  $769.70   2009

In [ ]:
df['Studio'] #Mostra o índice e a coluna Studio, outra maneira seria 'df.Studio', porém esse método mostra somente uma coluna e não mais

Title
Avengers: Endgame                   Buena Vista
Avatar                                      Fox
Titanic                               Paramount
Star Wars: The Force Awakens        Buena Vista
Avengers: Infinity War              Buena Vista
                                     ...
Yogi Bear                       Warner Brothers
Garfield: The Movie                         Fox
Cats & Dogs                     Warner Brothers
The Hunt for Red October              Paramount
Valkyrie                                    MGM
Name: Studio, Length: 782, dtype: object

In [26]:
df['Studio'].value_counts().head(10) #Conta quantas vezes o mesmo dado na coluna aparece no DataFrame

Studio
Warner Brothers    132
Buena Vista        125
Fox                117
Universal          109
Sony                86
Paramount           76
Dreamworks          27
Lionsgate           21
New Line            16
MGM                 11
Name: count, dtype: int64

In [ ]:
df[df['Studio'] == 'Universal'] #Mostra todos os filmes que na coluna Studio possui o dado Universal

                                Rank     Studio       Gross  Year
Title
Jurassic World                     6  Universal  $1,671.70   2015
Furious 7                          8  Universal  $1,516.00   2015
Jurassic World: Fallen Kingdom    13  Universal  $1,309.50   2018
The Fate of the Furious           17  Universal  $1,236.00   2017
Minions                           19  Universal  $1,159.40   2015
...                              ...        ...         ...   ...
The Break-Up                     763  Universal    $205.00   2006
Everest                          766  Universal    $203.40   2015
Patch Adams                      772  Universal    $202.30   1998
Kindergarten Cop                 775  Universal    $202.00   1990
Straight Outta Compton           776  Universal    $201.60   2015

[109 rows x 4 columns]

In [ ]:
released_by_universal = (df['Studio'] == 'Universal') #O resultado obtido na célula anterior foi adicionado a uma variável
df[released_by_universal].head()

                                Rank     Studio       Gross  Year
Title
Jurassic World                     6  Universal  $1,671.70   2015
Furious 7                          8  Universal  $1,516.00   2015
Jurassic World: Fallen Kingdom    13  Universal  $1,309.50   2018
The Fate of the Furious           17  Universal  $1,236.00   2017
Minions                           19  Universal  $1,159.40   2015

In [ ]:
released_in_2015 = df['Year'] == 2015 #adicionou a uma variável os filmes com o dado 2015 na coluna Year
df[released_by_universal & released_in_2015] #Filtrou utilizando as variáveis os filmes que são da Universal e(&) do ano de 2015

                        Rank     Studio       Gross  Year
Title
Jurassic World             6  Universal  $1,671.70   2015
Furious 7                  8  Universal  $1,516.00   2015
Minions                   19  Universal  $1,159.40   2015
Fifty Shades of Grey     165  Universal    $571.00   2015
Pitch Perfect 2          504  Universal    $287.50   2015
Ted 2                    702  Universal    $216.70   2015
Everest                  766  Universal    $203.40   2015
Straight Outta Compton   776  Universal    $201.60   2015

In [31]:
df[released_by_universal | released_in_2015] #Filtrou utilizando as variáveis os filmes que são da Universal ou(|) do ano de 2015

                                Rank       Studio       Gross  Year
Title
Star Wars: The Force Awakens       4  Buena Vista  $2,068.20   2015
Jurassic World                     6    Universal  $1,671.70   2015
Furious 7                          8    Universal  $1,516.00   2015
Avengers: Age of Ultron            9  Buena Vista  $1,405.40   2015
Jurassic World: Fallen Kingdom    13    Universal  $1,309.50   2018
...                              ...          ...         ...   ...
The Break-Up                     763    Universal    $205.00   2006
Everest                          766    Universal    $203.40   2015
Patch Adams                      772    Universal    $202.30   1998
Kindergarten Cop                 775    Universal    $202.00   1990
Straight Outta Compton           776    Universal    $201.60   2015

[140 rows x 4 columns]

In [ ]:
before_1975 = df['Year'] < 1975 #Adicionou em uma variável os  filmes que possuem na coluna Year dados menores que 1975
df[before_1975]

                    Rank           Studio     Gross  Year
Title
The Exorcist         252  Warner Brothers  $441.30   1973
Gone with the Wind   288              MGM  $402.40   1939
Bambi                540              RKO  $267.40   1942
The Godfather        604        Paramount  $245.10   1972
101 Dalmatians       708      Buena Vista  $215.90   1961
The Jungle Book      755      Buena Vista  $205.80   1967

In [ ]:
mid_80s = df['Year'].between(1983, 1986) #Adicionou em uma variável os filmes que possuem na coluna Year dados entre 1983 e 1986
df[mid_80s]

                                      Rank     Studio     Gross  Year
Title
Return of the Jedi                     222        Fox  $475.10   1983
Back to the Future                     311  Universal  $381.10   1985
Top Gun                                357  Paramount  $356.80   1986
Indiana Jones and the Temple of Doom   403  Paramount  $333.10   1984
Crocodile Dundee                       413  Paramount  $328.20   1986
Beverly Hills Cop                      432  Paramount  $316.40   1984
Rocky IV                               467        MGM  $300.50   1985
Rambo: First Blood Part II             469    TriStar  $300.40   1985
Ghostbusters                           485   Columbia  $295.20   1984
Out of Africa                          662  Universal  $227.50   1985

In [ ]:
has_dark_in_title = df.index.str.lower().str.contains('dark') #Adicionou em uma variável o filtro na coluna dos índices a palavra dark depois de passar todos os títulos para a forma minúscula 
df[has_dark_in_title]

                                Rank           Studio       Gross  Year
Title
Transformers: Dark of the Moon    23        Paramount  $1,123.80   2011
The Dark Knight Rises             27  Warner Brothers  $1,084.90   2012
The Dark Knight                   39  Warner Brothers  $1,004.90   2008
Thor: The Dark World             132      Buena Vista    $644.60   2013
Star Trek Into Darkness          232        Paramount    $467.40   2013
Fifty Shades Darker              309        Universal    $381.50   2017
Dark Shadows                     600  Warner Brothers    $245.50   2012
Dark Phoenix                     603              Fox    $245.10   2019

In [ ]:
df['Gross'].str.replace('$', '', regex = False).str.replace(',', '', regex = False)
#Foi retirado da coluna Gross os símbolos $ e , (replace) para no próximo passo transformar os dados de object (string) para float64

Title
Avengers: Endgame               2796.30
Avatar                          2789.70
Titanic                         2187.50
Star Wars: The Force Awakens    2068.20
Avengers: Infinity War          2048.40
                                  ...
Yogi Bear                        201.60
Garfield: The Movie              200.80
Cats & Dogs                      200.70
The Hunt for Red October         200.50
Valkyrie                         200.30
Name: Gross, Length: 782, dtype: object

In [ ]:
df['Gross'].str.replace('$', '', regex = False).str.replace(',', '', regex = False).astype(float)
#Foi transformado os dados da coluna Gross de object para float64 (astype(float))

Title
Avengers: Endgame               2796.3
Avatar                          2789.7
Titanic                         2187.5
Star Wars: The Force Awakens    2068.2
Avengers: Infinity War          2048.4
                                 ...
Yogi Bear                        201.6
Garfield: The Movie              200.8
Cats & Dogs                      200.7
The Hunt for Red October         200.5
Valkyrie                         200.3
Name: Gross, Length: 782, dtype: float64

In [ ]:
df['Gross'] = df['Gross'].str.replace('$', '', regex = False).str.replace(',', '', regex = False).astype(float)
#O pandas usa uma cópia para trabalhar no dados e não danificar o original. Neste passo foi modificado a coluna original Gross com os dados transformados

In [ ]:
df['Gross'].mean() #Como os dados da coluna Gross foram transformados em float dá para saber a média do valor total dos filmes

np.float64(439.0308184143222)

In [42]:
studios = df.groupby('Studio') #Foi agrupado as linhas do DataFrame baseados nos valores na coluna Studio

In [ ]:
studios['Gross'].count().head() #Contar o número de filme por studio

Studio
Artisan                     1
Buena Vista               125
CL                          1
China Film Corporation      1
Columbia                    5
Name: Gross, dtype: int64

In [ ]:
studios['Gross'].count().sort_values(ascending = False).head() #Filtrar do studio que possui a maior quantidade  de filmes para o menor na coluna Gross

Studio
Warner Brothers    132
Buena Vista        125
Fox                117
Universal          109
Sony                86
Name: Gross, dtype: int64

In [ ]:
studios['Gross'].sum().head() #Somou a quantidade de valor da coluna Gross para cada studio

Studio
Artisan                     248.6
Buena Vista               73585.0
CL                          228.1
China Film Corporation      699.8
Columbia                   1276.6
Name: Gross, dtype: float64

In [ ]:
studios['Gross'].sum().sort_values(ascending = False).head() #Filtrou do studio que possui o maior valor para o menor da coluna Gross

Studio
Buena Vista        73585.0
Warner Brothers    58643.8
Fox                50420.8
Universal          44302.3
Sony               32822.5
Name: Gross, dtype: float64